---
kind: type
id: T:Autodesk.Revit.UI.DoubleClickAction
source: html/b1d9dcb9-c1fb-12f5-16d3-edd16fb89ee3.htm
---
# Autodesk.Revit.UI.DoubleClickAction

Possible actions Revit can take in response to the user double-clicking on an element.

## Syntax (C#)
```csharp
public enum DoubleClickAction
```